/*
 * Даны следующие классы: Dollar и Euro.
 * Класс Dollar представляет сумму в долларах, а Euro - сумму в евро.
 * Определите операторы преобразования от типа Dollar в Euro и наоборот.
 * Допустим, 1 евро стоит 1,14 долларов.
 * При этом один оператор должен подразумевать явное, и один - неявное преобразование.
 */
Console.WriteLine();
